app/views/admin/index_admin.html.erb

<h1>Список статей</h1>
<h4>Всего: <%= Article.count %> статей</h4>
<h4>Всего: <%= Comment.count %> комментариев</h4>
---
SELECT COUNT(*) FROM `articles`
SELECT `articles`.* FROM `articles`
SELECT COUNT(*) FROM `comments`