app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles`  WHERE `articles`.`id` IN ('all', '---\n:conditions:\n- id = ? or slug = ?\n- 16b67eab-0147-4165-80c0-06536f02efa9\n- 16b67eab-0147-4165-80c0-06536f02efa9\n')

  def edit
    @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 1  ORDER BY `articles`.`id` ASC LIMIT 1

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO `articles` (`created_at`, `text`, `title`, `updated_at`) VALUES ('2015-10-11 12:08:50', 'Полозья пели свою  бесконечную  унылую  песню,  поскрипывала  упряжь,\r\nпозвякивали колокольчики на вожаках; но собаки и люди устали  и  двигались\r\nмолча. Они шли издалека, тропа была не утоптана после недавнего снегопада,\r\nи нарты, груженные мороженой  олениной,  с  трудом  двигались  по  рыхлому\r\nснегу,  сопротивляясь  с  настойчивостью   почти   человеческой.   Темнота\r\nсгущалась, но в этот вечер путники уже не собирались делать  привал.  Снег\r\nмягко падал в неподвижном воздухе, но не хлопьями, а маленькими снежинками\r\nтонкого рисунка. Было совсем  тепло,  каких-нибудь  десять  градусов  ниже\r\nнуля, Майерс и Беттлз подняли наушники, а Мэйлмют Кид даже снял рукавицы.', 'Северная одиссея', '2015-10-11 12:08:50')

  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 1  ORDER BY `articles`.`id` ASC LIMIT 1
UPDATE `articles` SET `name` = 'new article url', `slug` = 'new-article-url', `updated_at` = '2015-10-11 21:29:19' WHERE `articles`.`id` = 1

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 4  ORDER BY `articles`.`id` ASC LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 4