app/controllers/comments_controller.rb

  def create
    @article = Article.friendly.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`article_id`, `body`, `commenter`, `created_at`, `updated_at`) VALUES (1, 'первый!', 'админ', '2015-10-11 12:09:32', '2015-10-11 12:09:32')

  def destroy
    @article = Article.friendly.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 1 LIMIT 1
SELECT  `comments`.* FROM `comments`  WHERE `comments`.`article_id` = 1 AND `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1